# Используем официальный образ Node.js в качестве базового образа
FROM node:20

# Установка рабочей директории внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости проекта
RUN npm install

# Копируем исходный код приложения
COPY . .

# Выполняем сборку проекта
RUN npm run build

# Экспонируем порт, на котором работает приложение Nest.js (замените на свой порт при необходимости)
EXPOSE 3001

# Команда для запуска приложения в режиме продакшн
# CMD ["npm", "run", "start:prod"]
